Can't divide Wall's face to assign different materials to a vertically compound Wall.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotSplitVerticallyCompoundWall { get; }
  Visual Basic
Public Shared ReadOnly Property CannotSplitVerticallyCompoundWall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotSplitVerticallyCompoundWall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace